#+TITLE: Alter Emacs Config
#+AUTHOR: Zakame
#+DATE: 20160411
#+PROPERTY: header-args:emacs-lisp :results silent

** ob-http

This allows using =curl= inside Org Babel code blocks, e.g.

#+BEGIN_EXAMPLE
#+BEGIN_SRC http :pretty
  GET https://api.github.com/repos/zweifisch/ob-http/languages
  Accept: application/vnd.github.v3+json
#+END_SRC

#+RESULTS:
: {
:   "Emacs Lisp": 13709,
:   "Shell": 139
: }
#+END_EXAMPLE

#+BEGIN_SRC emacs-lisp
  (use-package ob-http
    :after org
    :ensure t
    :config
    (add-to-list 'org-babel-load-languages '(http . t))
    (org-babel-do-load-languages
     'org-babel-load-languages org-babel-load-languages))
#+END_SRC

